#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_prod.module.onestopauth.module.client_cypress-test-1626.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1626"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1626"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "9b72bd07-f5ab-40ed-ac87-c514dadacba2" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "918b0b69-b828-490f-89b4-a7683d0356d6" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "c7b3adcd-0108-4b30-a25a-af08f98f5e6d" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "sasa-1553"
        } -> null
      - id              = "6f702d72-22f5-4605-a9d5-f15cbf3f501d" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "41f04cb4-928f-4927-a420-5c3cf61f6efd" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "102b2cda-eb59-4fdd-8067-b8a764e704c0" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_prod.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "PUBLIC" -> null
      - client_id                                = "sasa-1553" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = true -> null
      - id                                       = "0ae37ec8-48f8-4ae7-9a66-e7eeb43e6b99" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "sasa-1553" -> null
      - pkce_code_challenge_method               = "S256" -> null
      - realm_id                                 = "onestopauth" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://c",
        ] -> null
      - web_origins                              = [
          - "+",
        ] -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "cypress-test-1626"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_test.module.onestopauth.module.client_cypress-test-1626.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "cypress-test-1626"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = true
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "cypress-test-1626"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://cypress",
        ]
      + web_origins                              = [
          + "+",
        ]
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      - client_id       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_guid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_guid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "28a9550f-c4f1-4da0-af39-bd4c1034b626" -> null
      - name            = "bceid_business_guid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      - client_id       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_business_name"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_business_name"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "49452f87-ddb5-4024-bab5-d47612a1a7bb" -> null
      - name            = "bceid_business_name" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      - client_id       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "bceid_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "bceid_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "dfda7352-d713-4695-b453-ea130418bde2" -> null
      - name            = "bceid_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - config          = {
          - "access.token.claim"                   = "true"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "true"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "true"
          - "usermodel.clientRoleMapping.clientId" = "sasa-1553"
        } -> null
      - id              = "c97fcc72-96bb-48fe-a406-afcd223fa2f6" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      - client_id       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - config          = {
          - "access.token.claim"         = "true"
          - "access.tokenResponse.claim" = "false"
          - "claim.name"                 = "identity_provider"
          - "id.token.claim"             = "true"
          - "jsonType.label"             = "String"
          - "user.session.note"          = "identity_provider"
        } -> null
      - id              = "15d7b52b-28de-46a7-ba17-d12557b97f14" -> null
      - name            = "IDP" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usersessionmodel-note-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be destroyed
  - resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      - client_id       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - config          = {
          - "access.token.claim"   = "true"
          - "claim.name"           = "idir_userid"
          - "id.token.claim"       = "true"
          - "jsonType.label"       = "String"
          - "user.attribute"       = "idir_userid"
          - "userinfo.token.claim" = "true"
        } -> null
      - id              = "3f59c869-c3e8-4f19-9b7b-e0d8fc681636" -> null
      - name            = "idir_userid" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-attribute-mapper" -> null
      - realm_id        = "onestopauth" -> null
    }

  # module.keycloak_test.module.onestopauth.module.client_sasa-1553.keycloak_openid_client.this will be destroyed
  - resource "keycloak_openid_client" "this" {
      - access_type                              = "PUBLIC" -> null
      - client_id                                = "sasa-1553" -> null
      - client_secret                            = (sensitive value)
      - consent_required                         = false -> null
      - direct_access_grants_enabled             = false -> null
      - enabled                                  = true -> null
      - exclude_session_state_from_auth_response = false -> null
      - full_scope_allowed                       = true -> null
      - id                                       = "a7188151-af3a-4058-85f4-e69a1a337a8d" -> null
      - implicit_flow_enabled                    = false -> null
      - name                                     = "sasa-1553" -> null
      - pkce_code_challenge_method               = "S256" -> null
      - realm_id                                 = "onestopauth" -> null
      - service_accounts_enabled                 = false -> null
      - standard_flow_enabled                    = true -> null
      - valid_redirect_uris                      = [
          - "http://b",
        ] -> null
      - web_origins                              = [
          - "+",
        ] -> null
    }

Plan: 21 to add, 0 to change, 21 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 1988 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*